000100171219     H NOMAIN
000200171219     ***************************************************************
000300171219     ********************* AIRTHMATIC PROCEDURE ****************
000400171220     D CINT            PR             3S 0
000500171220     D P                              3S 0
000600171220     D T                              3S 0
000700171220     D R                              3S 0
000800171219
000900171219
001000171220     P CINT            B                   EXPORT
001100171219
001200171220     D CINT            PI             3S 0
001300171220     D P                              3S 0
001400171220     D T                              3S 0
001500171220     D R                              3S 0
001600171219
001700171220     D INT             S              3S 0
001800171220     D A               S              3S 0
001900171220
002000171220      /FREE
002100171220          A = P * ((1+(R/100))** T);
002200171220       INT = A - P;
002300171220       RETURN INT;
002400171219      /END-FREE
002500171219
002600171220     P CINT            E
002700171219
