000100171219     H NOMAIN
000200171219     ***************************************************************
000300171219     ********************* AIRTHMATIC PROCEDURE ****************
000400171220     D SINT            PR             3S 0
000500171220     D P                              3S 0
000600171220     D T                              3S 0
000700171220     D R                              3S 0
000800171219
000900171219
001000171220     P SINT            B                   EXPORT
001100171219
001200171220     D SINT            PI             3S 0
001300171220     D P                              3S 0
001400171220     D T                              3S 0
001500171220     D R                              3S 0
001600171219
001700171220     D INT             S              3S 0
001800171220
001900171220      /FREE
002000171220       INT = (P * R * T)/100;
002100171220       RETURN INT;
002200171219      /END-FREE
002300171219
002400171220     P SINT            E
002500171219
